pranav9012/Embedded_Systems/Tiva_TM4C123GH6PM/ADC Potentiometer/startup_TM4C123.s
        PUBWEAK ADC1SS2_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
ADC1SS2_Handler
        B ADC1SS2_Handler

        PUBWEAK ADC1SS3_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
ADC1SS3_Handler
        B ADC1SS3_Handler

        PUBWEAK GPIOJ_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOJ_Handler
        B GPIOJ_Handler


        PUBWEAK GPIOK_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOK_Handler
        B GPIOK_Handler

        PUBWEAK GPIOL_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOL_Handler
        B GPIOL_Handler

        PUBWEAK SSI2_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SSI2_Handler
        B SSI2_Handler

        PUBWEAK SSI3_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
SSI3_Handler
        B SSI3_Handler

        PUBWEAK UART3_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UART3_Handler
        B UART3_Handler

        PUBWEAK UART4_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UART4_Handler
        B UART4_Handler

        PUBWEAK UART5_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UART5_Handler
        B UART5_Handler

        PUBWEAK UART6_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UART6_Handler
        B UART6_Handler

        PUBWEAK UART7_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
UART7_Handler
        B UART7_Handler

        PUBWEAK I2C2_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
I2C2_Handler
        B I2C2_Handler

        PUBWEAK I2C3_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
I2C3_Handler
        B I2C3_Handler

        PUBWEAK TIMER4A_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER4A_Handler
        B TIMER4A_Handler

        PUBWEAK TIMER4B_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER4B_Handler
        B TIMER4B_Handler

        PUBWEAK TIMER5A_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER5A_Handler
        B TIMER5A_Handler

        PUBWEAK TIMER5B_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
TIMER5B_Handler
        B TIMER5B_Handler

        PUBWEAK WTIMER0A_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER0A_Handler
        B WTIMER0A_Handler

        PUBWEAK WTIMER0B_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER0B_Handler
        B WTIMER0B_Handler

        PUBWEAK WTIMER1A_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER1A_Handler
        B WTIMER1A_Handler

        PUBWEAK WTIMER1B_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER1B_Handler
        B WTIMER1B_Handler

        PUBWEAK WTIMER2A_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER2A_Handler
        B WTIMER2A_Handler

        PUBWEAK WTIMER2B_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER2B_Handler
        B WTIMER2B_Handler

        PUBWEAK WTIMER3A_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER3A_Handler
        B WTIMER3A_Handler

        PUBWEAK WTIMER3B_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER3B_Handler
        B WTIMER3B_Handler

        PUBWEAK WTIMER4A_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER4A_Handler
        B WTIMER4A_Handler

        PUBWEAK WTIMER4B_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER4B_Handler
        B WTIMER4B_Handler

        PUBWEAK WTIMER5A_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER5A_Handler
        B WTIMER5A_Handler

        PUBWEAK WTIMER5B_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
WTIMER5B_Handler
        B WTIMER5B_Handler

        PUBWEAK FPU_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
FPU_Handler
        B FPU_Handler

        PUBWEAK I2C4_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
I2C4_Handler
        B I2C4_Handler

        PUBWEAK I2C5_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
I2C5_Handler
        B I2C5_Handler

        PUBWEAK GPIOM_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOM_Handler
        B GPIOM_Handler

        PUBWEAK GPION_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPION_Handler
        B GPION_Handler

        PUBWEAK QEI2_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
QEI2_Handler
        B QEI2_Handler

        PUBWEAK GPIOP0_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOP0_Handler
        B GPIOP0_Handler

        PUBWEAK GPIOP1_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOP1_Handler
        B GPIOP1_Handler

        PUBWEAK GPIOP2_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOP2_Handler
        B GPIOP2_Handler

        PUBWEAK GPIOP3_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOP3_Handler
        B GPIOP3_Handler

        PUBWEAK GPIOP4_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOP4_Handler
        B GPIOP4_Handler

        PUBWEAK GPIOP5_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOP5_Handler
        B GPIOP5_Handler

        PUBWEAK GPIOP6_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOP6_Handler
        B GPIOP6_Handler

        PUBWEAK GPIOP7_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOP7_Handler
        B GPIOP7_Handler

        PUBWEAK GPIOQ0_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOQ0_Handler
        B GPIOQ0_Handler

        PUBWEAK GPIOQ1_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOQ1_Handler
        B GPIOQ1_Handler

        PUBWEAK GPIOQ2_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOQ2_Handler
        B GPIOQ2_Handler

        PUBWEAK GPIOQ3_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOQ3_Handler
        B GPIOQ3_Handler

        PUBWEAK GPIOQ4_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOQ4_Handler
        B GPIOQ4_Handler

        PUBWEAK GPIOQ5_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOQ5_Handler
        B GPIOQ5_Handler

        PUBWEAK GPIOQ6_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOQ6_Handler
        B GPIOQ6_Handler

        PUBWEAK GPIOQ7_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOQ7_Handler
        B GPIOQ7_Handler

        PUBWEAK GPIOR_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOR_Handler
        B GPIOR_Handler

        PUBWEAK GPIOS_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
GPIOS_Handler
        B GPIOS_Handler

        PUBWEAK PMW1_0_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PMW1_0_Handler
        B PMW1_0_Handler

        PUBWEAK PWM1_1_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM1_1_Handler
        B PWM1_1_Handler

        PUBWEAK PWM1_2_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM1_2_Handler
        B PWM1_2_Handler

        PUBWEAK PWM1_3_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM1_3_Handler
        B PWM1_3_Handler

        PUBWEAK PWM1_FAULT_Handler
        SECTION .text:CODE:REORDER:NOROOT(1)
PWM1_FAULT_Handler
        B PWM1_FAULT_Handler



        END
